nradulovic/esolid-hal/src/port/family/stm32f10x/sys.c
/******************************************************************************
 * This file is part of eSolid
 *
 * Copyright (C) 2011, 2012 - Nenad Radulovic
 *
 * eSolid is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * eSolid is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with eSolid; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin St, Fifth Floor,
 * Boston, MA  02110-1301  USA
 *
 * web site:    http://blueskynet.dyndns-server.com
 * e-mail  :    blueskyniss@gmail.com
 *//***********************************************************************//**
 * @file
 * @author      Nenad Radulovic
 * @brief       Sistemski drajver za STM32F10x seriju.
 * @addtogroup  port_stm32f10x
 *********************************************************************//** @{ */

/*=========================================================  INCLUDE FILES  ==*/
#include "hal/hal.h"
#include "stm32f10x_pkg.h"

/*=========================================================  LOCAL DEFINES  ==*/
/*=========================================================  LOCAL MACRO's  ==*/
/*======================================================  LOCAL DATA TYPES  ==*/
/*=============================================  LOCAL FUNCTION PROTOTYPES  ==*/

static void sysPerfSetHigh(
    void);

static void sysPerfSetMedium(
    void);

static void sysPerfSetDefault(
    void);

/*=======================================================  LOCAL VARIABLES  ==*/

/**
 * @brief       Trenutni sistemski profil
 */
static esSysPerf_T sysPerfProfile;

/*======================================================  GLOBAL VARIABLES  ==*/
/*============================================  LOCAL FUNCTION DEFINITIONS  ==*/

static void sysPerfSetHigh(
    void) {

    uint32_t startUpCntr;
    uint32_t status;

    RCC->CR |= RCC_CR_HSION;                                                    /* Enable HSE                                               */
    startUpCntr = 0UL;

    do {
        status = RCC->CR & RCC_CR_HSIRDY;
        startUpCntr++;
    } while ((0UL == status) && (HSE_STARTUP_TIMEOUT != startUpCntr));

    if (0UL != status) {

#if (24000000UL == PORT_MAX_CPU_FREQ_)

# if defined(STM32F10X_LD) || defined(STM32F10X_LD_VL) ||                       \
    defined(STM32F10X_MD) || defined(STM32F10X_MD_VL)

        if (RCC_CFGR_SWS_HSI != (RCC->CFGR & RCC_CFGR_SWS)) {
            ES_HWREG_SET(
                RCC->CFGR,
                RCC_CFGR_SW,
                RCC_CFGR_SW_HSI);

            while (RCC_CFGR_SWS_HSI != (RCC->CFGR & RCC_CFGR_SWS)) {
                ;
            }
        }
        ES_HWREG_SET(
            RCC->CR,
            RCC_CR_HSEON | RCC_CR_PLLON,
            0UL);
        FLASH->ACR &= ~FLASH_ACR_HLFCYA;
        RCC->CFGR &= ~RCC_CFGR_PLLSRC;                                          /* PLL source = HSI/2                                       */
        ES_HWREG_SET(
            RCC->CFGR,
            RCC_CFGR_PLLMULL,
            RCC_CFGR_PLLMULL6);
        RCC->CR |= RCC_CR_PLLON;

        while (0UL == (RCC->CR & RCC_CR_PLLRDY)) {
            ;
        }
        ES_HWREG_SET(
            RCC->CFGR,
            RCC_CFGR_SW,
            RCC_CFGR_SW_PLL);

        while (RCC_CFGR_SWS_PLL != (RCC->CFGR & RCC_CFGR_SWS)) {
            ;
        }
# elif defined(STM32F10X_HD) || defined(STM32F10X_HD_VL)
# error "NOT IMPLEMENTED"
# else
# error "NOT IMPLEMENTED"
# endif
#else
# error "NOT IMPLEMENTED"
#endif
        ES_HWREG_SET(                                                           /* HCLK = SYSCLK                                            */
            RCC->CFGR,
            RCC_CFGR_HPRE,
            RCC_CFGR_HPRE_DIV1);
        ES_HWREG_SET(                                                           /* PCLK2 = SYSCLK                                           */
            RCC->CFGR,
            RCC_CFGR_PPRE1,
            RCC_CFGR_PPRE1_DIV1);
        ES_HWREG_SET(                                                           /* PCLK1 = HCLK                                             */
            RCC->CFGR,
            RCC_CFGR_PPRE2,
            RCC_CFGR_PPRE2_DIV1);
    } else {
        /* Greska! HSI nece da se upali. */
    }


  /* #define STM32F10X_HD */     /*!< STM32F10X_HD: STM32 High density devices */
  /* #define STM32F10X_HD_VL */  /*!< STM32F10X_HD_VL: STM32 High density value line devices */
  /* #define STM32F10X_XL */     /*!< STM32F10X_XL: STM32 XL-density devices */
  /* #define STM32F10X_CL)
/*#ifdef STM32F10X_CL*/
}

static void sysPerfSetMedium(
    void) {

    uint32_t startUpCntr;
    uint32_t status;

    RCC->CR |= RCC_CR_HSION;                                                    /* Enable HSE                                               */
    startUpCntr = 0UL;

    do {
        status = RCC->CR & RCC_CR_HSIRDY;
        startUpCntr++;
    } while ((0UL == status) && (HSE_STARTUP_TIMEOUT != startUpCntr));

    if (0UL != status) {

#if defined(STM32F10X_LD) || defined(STM32F10X_LD_VL) ||                        \
    defined(STM32F10X_MD) || defined(STM32F10X_MD_VL)

        if (RCC_CFGR_SWS_HSI != (RCC->CFGR & RCC_CFGR_SWS)) {
            ES_HWREG_SET(
                RCC->CFGR,
                RCC_CFGR_SW,
                RCC_CFGR_SW_HSI);

            while (RCC_CFGR_SWS_HSI != (RCC->CFGR & RCC_CFGR_SWS)) {
                ;
            }
        }
        ES_HWREG_SET(
            RCC->CR,
            RCC_CR_HSEON | RCC_CR_PLLON,
            0UL);
        FLASH->ACR &= ~FLASH_ACR_HLFCYA;
        RCC->CFGR &= ~RCC_CFGR_PLLSRC;                                          /* PLL source = HSI/2                                       */
        ES_HWREG_SET(
            RCC->CFGR,
            RCC_CFGR_PLLMULL,
            RCC_CFGR_PLLMULL4);
        RCC->CR |= RCC_CR_PLLON;

        while (0UL == (RCC->CR & RCC_CR_PLLRDY)) {
            ;
        }
        ES_HWREG_SET(
            RCC->CFGR,
            RCC_CFGR_SW,
            RCC_CFGR_SW_PLL);

        while (RCC_CFGR_SWS_PLL != (RCC->CFGR & RCC_CFGR_SWS)) {
            ;
        }

#elif defined(STM32F10X_HD) || defined(STM32F10X_HD_VL)
#error "NOT IMPLEMENTED"
#else
#error "NOT IMPLEMENTED"
#endif
        ES_HWREG_SET(                                                           /* HCLK = SYSCLK                                            */
            RCC->CFGR,
            RCC_CFGR_HPRE,
            RCC_CFGR_HPRE_DIV1);
        ES_HWREG_SET(                                                           /* PCLK2 = SYSCLK                                           */
            RCC->CFGR,
            RCC_CFGR_PPRE1,
            RCC_CFGR_PPRE1_DIV1);
        ES_HWREG_SET(                                                           /* PCLK1 = HCLK                                             */
            RCC->CFGR,
            RCC_CFGR_PPRE2,
            RCC_CFGR_PPRE2_DIV1);
    } else {
        /* Greska! HSI nece da se upali. */
    }
}

static void sysPerfSetDefault(
    void) {

    uint32_t startUpCntr;
    uint32_t status;

    RCC->CR |= RCC_CR_HSION;                                                    /* Enable HSE                                               */
    startUpCntr = 0UL;

    do {
        status = RCC->CR & RCC_CR_HSIRDY;
        startUpCntr++;
    } while ((0UL == status) && (HSE_STARTUP_TIMEOUT != startUpCntr));

