nradulovic/esolid-hal/src/port/family/stm32f10x/sys.c
    /* Wait till PLL is ready */
    while((RCC->CR & RCC_CR_PLLRDY) == 0)
    {
    }
    
    /* Select PLL as system clock source */
    RCC->CFGR &= (uint32_t)((uint32_t)~(RCC_CFGR_SW));
    RCC->CFGR |= (uint32_t)RCC_CFGR_SW_PLL;    

    /* Wait till PLL is used as system clock source */
    while ((RCC->CFGR & (uint32_t)RCC_CFGR_SWS) != (uint32_t)0x08)
    {
    }
  }
  else
  { /* If HSE fails to start-up, the application will have wrong clock 
         configuration. User can add here some code to deal with this error */
  }
}
#endif

/*===================================  GLOBAL PRIVATE FUNCTION DEFINITIONS  ==*/
/*====================================  GLOBAL PUBLIC FUNCTION DEFINITIONS  ==*/

/*----------------------------------------------------------------------------*/
void esSysPerfSet(
    esSysPerf_T    speed) {

    switch (speed) {
        case ES_SYS_PERF_HIGH : {
            sysPerfSetHigh();
            break;
        }

        case ES_SYS_PERF_MEDIUM : {
            sysPerfSetMedium();
            break;
        }

        case ES_SYS_PERF_LOW : {
            sysPerfSetDefault();
            break;
        }

        default : {
            sysPerfSetDefault();
            break;
        }
    }
}

/*----------------------------------------------------------------------------*/
esSysPerf_T esSysPerfGet(
    void) {

    return (sysPerfProfile);
}

/*----------------------------------------------------------------------------*/
void sysInit(
    void) {

    RCC->CIR = 0UL;                                                             /* Disable all interrupts                                   */
    sysPerfSetDefault();
}

/*================================*//** @cond *//*==  CONFIGURATION ERRORS  ==*/
/** @endcond *//** @} *//******************************************************
 * END of sys.c
 ******************************************************************************/
